print('-------------------------------Аимация стандартных объектов--------------------------------')

import matplotlib.pyplot as plt 
import numpy as np
from matplotlib.animation import FuncAnimation

#------------------------Создание пространства для анимации------------------------
fig, ax = plt.subplots()

#------------------------Создание анимируемого объкта------------------------
anim_object_1, = plt.plot([], [], '-', lw=3, color='b') 
anim_object_2, = plt.plot([], [], 'o', color='r')  

#------------------------Параметры объектов------------------------
N = 100                                                     #Количество точек / кадров

#Параметры первого объекта
x1 = []
y1 = []

#Параметры второго объекта
x2 = np.linspace(0, 2 * np.pi, N)
y2 = np.cos(x2)

#------------------------Параметры анимации------------------------
n = []                                                      #Массив для определения номера кадров
ax.set_xlim(0, 2 * np.pi)                                   #Пределы изменения переменной X
ax.set_ylim(-1, 1)                                          #Пределы изменения переменной Y

#------------------------Функция подстановки параметров------------------------
def update(frame):                                              
    #Передача координат анимируемому объекту 1
    x1.append(frame)                                        #Расчёт координаты X
    y1.append(np.sin(frame))                                #Расчёт координаты Y
    anim_object_1.set_data(x1, y1)                          #Передачакоординат анимируемому оъекту
    
    #Передача номера кадра анимируемому объекту 2
    n.append(frame)
    anim_object_2.set_data(x2[len(n)-1], y2[len(n)-1])
    
    #Украшательства
    ax.set_title('Какой-нибудь параметр {}'.format(frame))
    
#------------------------Анимация------------------------
ani = FuncAnimation(fig, update, frames = np.linspace(0, 2*np.pi, N), interval = 100)

ani.save('lec_7-animation.gif')