#-----------------Циклы и условия----------------------------------------------
#-----------------Конструкция if-----------------------------------------------
'''
#if '<условие 1>' :
#    '<оператор 1>'
'''

#-----------------Примеры конструкции if---------------------------------------

if 1:
    print('hello 1')
    
a = 3
if a > 1:
    print('hello 3')
    
a = 3                           #Операция присваивания
if a == 3:                      #Операция сравнения
    print('hello 3')

#-----------------Конструкция if-else------------------------------------------
'''
#if '<условие 1>' :
#    '<оператор 1>'
#    '<оператор 2>'
#else:
#    '<оператор 3>'
'''
#-----------------Примеры конструкции if-else----------------------------------
a = 3
if a > 4 :
    print('hello 4')
else:
    print('Tupo hello')

#-----------------Конструкция if-elif-else-------------------------------------
'''
#if '<условие 1>' :
#    '<оператор 1>'
#    '<оператор 2>'
#    
#elif '<условие 2>':
#    '<оператор 3>'
#
#else:
#    '<оператор 4>'
'''
#-----------------Примеры конструкции if-elif-else-----------------------------
a = 3
if a > 5 :
    print('hello 5')
elif a < 2:
    print('hello 2')
else:
    print('Tupo hello')

#-----------------Логические операции------------------------------------------
a = 3
b = 4
c = 5

if a > 3 and b == 2:            #and - операция логического выражения "И"
    print('Good')
elif b > 3 or c == 5:           #or - операция логического выражения "ИЛИ"
    print('Best')
else:
     print('Bad')  
     
#-----------------Операторы for и while----------------------------------------
#-----------------Конструкция for----------------------------------------------
'''
for <переменная цикла> in <значение переменной>:     #Заголовок цикла
    <инструкция 1>
    <инструкция 2>

'''
for i in 1,3,4:
    print(i**2, end = ' ')      #end - создаёт символы после результата

print()

for i in 1,3,4:
    print(i**2, sep = ' ')      #sep - пишет результат в столбик

a = [1,5,7,10]
for i in a:
    print(i**3, end = ' "Yes" ')
    
print()
#-----------------Оператор range - генератор последовательностей---------------
'''
for <переменная цикла> in range(start, stop, step):
    <инструкция 1>
    <инструкция 2>
'''
for i in range(0, 10, 1):
    print(i, end = ' ')      

print()

#-----------------Конструкция while--------------------------------------------
'''
while <переменная цикла> <условие> <значение переменной>:
    <инструкция 1>
    <инструкция 2>
'''

#-----------------Команда breake-----------------------------------------------
for i in 'hello world':             
    if i == 'o':
        break                     #Команда быстрого прерыва цикла
    print(i * 2, end = '')
    
print()

#-----------------Команда continue---------------------------------------------
for i in 'hello world':             
    if i == 'o':
        continue                   #Команда пропуска
    print(i * 2, end = '')

#-----------------Конец лекции-------------------------------------------------  