print('--------------------------------Zadanie_1-------------------------------')
print('Hello, World!')

print('Маша + Петя = Любовь')

print('3 + 4')

print(3 + 4)

print('--------------------------------Zadanie_2-------------------------------')
x = 'Hello, World!'
print(type(x))

x = 3 + 4
print(type(x))

x = 3 / 4
print(type(x))

x = [1, 2, 5, 10, 100]
print(type(x))

print('--------------------------------Zadanie_3-------------------------------')
x = 3
y = (x**1.5 * (4 * x**7 - x**5)) / (x**3 + 3/x) + 80 * ((27 * x**4) + (12 * x**3) - (5 * x**2) + 10)**0.5
print(y)

x = 3
y = ((3 % 2) + ((16.7 * 4.32) // 1)) / (14.5 + (31 % 12) - (x**3.4 // 1))
print(y)

print('--------------------------------Zadanie_4-------------------------------')
a = [1,5,'Good','Bad']
b = [9,'Blue','Red',11]

print(a[1] + b[3])

print(a[2] + b[2])

print(a[0] * b[0])

print(a[1] ** b[3])

print(a + b)

print('--------------------------------Zadanie_5-------------------------------')

Z = []
q = int(input('Введите кол-во чисел: '))
for i in range (0, q, 1):
    z = int(input('Введите число: '))
    Z.append(z)
print(Z)
