print('--------------------------------Zadanie_1-------------------------------')
# вид уравнения: a * X**2 + b * X + c = 0, где a, b, c коэффициенты.
a = 0
b = 0
c = 0
print('Вид уравнения: a * X**2 + b * X + c = 0, где a, b, c коэффициенты.')
print('Введите коэффициенты квадратного уравнения. (не забудьте про знаки!)')

a = int(input('Введите коэффициент a = '))
b = int(input('Введите коэффициент b = '))
c = int(input('Введите коэффициент c = '))

D = b**2 - 4 * a * c

if D > 0:
    X_1 = (-b + (D)**0.5)/(2 * a)
    X_2 = (-b - (D)**0.5)/(2 * a)
    print('Первый корень уравнения X_1 = ',X_1)
    print('Второй корень уравнения X_2 = ',X_2)
elif D == 0:
    X = -b / (2 * a)
    print('Единственный корень уравнения X = ', X)
elif D < 0:
    print('Нет корней')
else:
    print('ERROR')