print('--------------------------------Zadanie_1-------------------------------')
print('Hello, World!')

print('Маша + Петя = Любовь')

print('3 + 4')
x = 3 + 4
print('x=' x)

print('--------------------------------Zadanie_2-------------------------------')
x = 'Hello, World!'
print(type(x))

x = 3 + 4
print(type(x))

x = 3 / 4
print(type(x))

x = [1, 2, 5, 10, 100]
print(type(x))

print('--------------------------------Zadanie_3-------------------------------')
x = 3
y = (x**1.5 * (4 * x**7 - x**5)) / (x**3 + 3/x) + 80 * ((27 * x**4) + (12 * x**3) - (5 * x**2) + 10)**0.5
print(y)

x = 3
y = ((3 % 2) + ((16.7 * 4.32) // 1)) / (14.5 + (31 % 12) - (x**3.4 // 1))
print(y)

print('--------------------------------Zadanie_4-------------------------------')
a = [1,5,'Good','Bad']
b = [9,'Blue','Red',11]

print(a[1] + b[3])

print(a[2] + b[2])

print(a[0] * b[0])

print(a[1] ** b[3])

print(a + b)

print('--------------------------------Zadanie_5-------------------------------')

'''
Работает, но мне не нравится команда append.
Она создаёт список, который системой воспринимается как str, а не int(т.е. целой конструкцией).
Из-за этого нельзя вывести отдельные элементы, т.е. Z[1], Z[2] и т.д.
Можно вывести только Z[0], а выглядить это будет примерно как |0,1,2| 
'''
Z = []
Z.append(input('Введите числа '))
print(Z)

#'''
#Нерабочая схема, которую я пытался довести до ума
#(Оставил на всякий случай)
#
##Z = []
##q = int(input('Введите кол-во чисел: '))
##for q in range (0, q, 1):
##    Z = input('Введите число: ')
##    if q == 0:
##        Z = [Z]
##    else:
##        Z.append(Z)
##print(Z)
#'''
